tests/solver_wrappers/openfoam/test_v8/tube3d/setup_openfoam/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	".*"
	{
	    type            fixedValue;
        value           uniform (0 0 0);
	}

 	mantle
	{
	    type  	        fixedValue;
	    value           uniform ( 0 0 0 );
	}
} 

// ************************************************************************* //
